/* Вывести на экран все возможные комбинации слов "мама", "мыла", "раму".
*/
public class Main {
    public static void main(String[] args) {
        String[] stroka = {"Мама Мыла Раму"};
        String newstr = " ";
        for (int i = 0; i < stroka.length; i++) {
             if (newstr==stroka[i]) newstr+= " "+1;

                System.out.print();


            }
        }

                }


    
