/*Task_1.1
Напишите фрагмент класса (группу комманд), который будет присваивать значения 5 и9 двум переменным,
а затем третья переменная будет получать значение, равное сумме значений первых двух переменныхю
*/
public class Main {
    public static void main(String[]args){
int a =5;
int b =9;
                 System.out.println(a+b);
