*/
Дан массив с числамию Проверьте, что в этом массиве есть число 5.
Если есть - выведите "да", а если нет - выведите "нет".
public class Main {
/*
    public static void main(String[] args) {
        int[] nums = {3, 13, 10, 34, 47, 55};
        int a = nums[0];
        for (int i=0;i<6;i++) {
            a+=nums[i];
            if(nums[i]==5); System.out.println("Да");
            if(nums[i]!=5); else System.out.println("Heт");



        }


    }

}
